'''
Напишите программу, которая принимает на вход число N
и выдает набор произведений чисел от 1 до N.
Пример:

- пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)
'''
N = 4
count = 1
product = 1

print("[", end="")
while count <= N:
    product *= count
    count += 1
    print(" ", product, end=" ")
print("]", end="")
